# Statistics Introduction Applied to Data Science
## Lab : Three
## Dataframes

In this lab, we use import sentence to load pandas and numpy python libraries that we need to work with dataframe.

In [1]:
import pandas as pd
import numpy as np

We need read_csv method to load Operations.csv dataset on df_operations dataframe. The path depend where you have stored csv files.

In [2]:
df_operations = pd.read_csv('data/Operations.csv')

In [3]:
df_operations['Customer'].count()

19

By default, head() method return the five first rows from dataframe.

In [4]:
df_operations.head()

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent
0,10000,Person,Cash,120000,150000,240,Canada,America
1,10001,Company,Cash,521400,651750,1043,Japan,Asia
2,10002,Company,Credit Card,451000,563750,902,Mexico,America
3,10003,Company,Transfer,565000,706250,1130,Spain,Europe
4,10004,Person,Transfer,512300,640375,1024,Argentina,America

We can change default value, indicating the number of rows between parentheses.

In [5]:
df_operations.head(3)

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent
0,10000,Person,Cash,120000,150000,240,Canada,America
1,10001,Company,Cash,521400,651750,1043,Japan,Asia
2,10002,Company,Credit Card,451000,563750,902,Mexico,America

With info() method get basic information from dataframe.

In [6]:
df_operations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer       19 non-null     int64
 1   Customer Type  19 non-null     object
 2   Payment Type   19 non-null     object
 3   Purchases      19 non-null     int64
 4   Sales          19 non-null     int64
 5   Refunds        19 non-null     int64
 6   Country        19 non-null     object
 7   Continent      19 non-null     object
dtypes: int64(4), object(4)
memory usage: 1.3+ KB

With dtypes we can see data type from each dataframe column.

In [7]:
df_operations.dtypes

Customer          int64
Customer Type    object
Payment Type     object
Purchases         int64
Sales             int64
Refunds           int64
Country          object
Continent        object
dtype: object

Query dataframe columns names.

In [8]:
df_operations.columns.values

array(['Customer', 'Customer Type', 'Payment Type', 'Purchases', 'Sales',
       'Refunds', 'Country', 'Continent'], dtype=object)

Query dataframe rows index.

In [9]:
df_operations.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18])

With size method we can see how many data are there in the dataframe.

In [10]:
df_operations.size

152

The shape method return the tuple (rows, columns) from dataframe.

In [11]:
df_operations.shape

(19, 8)

Unlike the head() method, the tail() method return by default, the last five rows from dataframe.
Of course, you can change this.

In [12]:
df_operations.tail()

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent
14,10014,Company,Transfer,241010,301262,480,EEUU,America
15,10015,Company,Credit Card,560122,700152,1120,Mexico,America
16,10016,Person,Credit Card,362200,452750,0,Canada,America
17,10017,Person,Cash,452230,565287,903,Japan,Asia
18,10018,Company,Cash,521000,651250,1042,Spain,Europe

In [13]:
df_operations.tail(2)

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent
17,10017,Person,Cash,452230,565287,903,Japan,Asia
18,10018,Company,Cash,521000,651250,1042,Spain,Europe

## How to get slices from dataframe.

Get only America operations.

In [14]:
df_operations [(df_operations['Continent'] == 'America')].head()

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent
0,10000,Person,Cash,120000,150000,240,Canada,America
2,10002,Company,Credit Card,451000,563750,902,Mexico,America
4,10004,Person,Transfer,512300,640375,1024,Argentina,America
5,10005,Person,Transfer,415500,519375,0,Canada,America
6,10006,Company,Credit Card,696300,870375,1392,EEUU,America

Get America operations and person customer type.

In [15]:
df_operations [(df_operations['Continent'] == 'America') & (df_operations['Customer Type'] == 'Person')].head()

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent
0,10000,Person,Cash,120000,150000,240,Canada,America
4,10004,Person,Transfer,512300,640375,1024,Argentina,America
5,10005,Person,Transfer,415500,519375,0,Canada,America
7,10007,Person,Cash,741000,926250,1482,Chile,America
11,10011,Person,Transfer,520033,650041,1041,EEUU,America

Get only sales and country columns.

In [16]:
df_operations[['Sales','Country']].head()

    Sales    Country
0  150000     Canada
1  651750      Japan
2  563750     Mexico
3  706250      Spain
4  640375  Argentina

## LOC

LOC is primarily label based; when two arguments are used. You use column headers and row indexes to select the data you want. loc can also take an integer as a row or column number.
In this example, we gets sales and country columns of first row. Remember, the rows index begin with zero.

In [17]:
df_operations.loc[0,['Sales','Country']]

Sales      150000
Country    Canada
Name: 0, dtype: object

Look at the data types is changed. The result is not a dataframe but a series type.

In [18]:
type(df_operations.loc[0,['Sales','Country']])

pandas.core.series.Series

Another way to do and get a dataframe.

In [19]:
df_operations.loc[0:0,['Sales','Country']]

    Sales Country
0  150000  Canada

In [20]:
type(df_operations.loc[0:0,['Sales','Country']])

pandas.core.frame.DataFrame

In [21]:
df_operations.loc[1:2,['Sales','Country']]

    Sales Country
1  651750   Japan
2  563750  Mexico

## ILOC

iloc is integer-based. You use column numbers and row numbers to get rows or columns at particular positions in the data frame.
Below, the code to get the rows one and two from sales and country columns.

In [22]:
df_operations.iloc[1:3,4:7]

    Sales  Refunds Country
1  651750     1043   Japan
2  563750      902  Mexico

Ops, it's not good. We get refund column too. Let's to resolve it

In [23]:
df_operations.iloc[1:3,[4,6]]

    Sales Country
1  651750   Japan
2  563750  Mexico

The astype method allows us to modify the data type for one or more columns separated by commas. At the beginning of the lab we see that the Customer column was imported with the int64 data type. Although it is true that it is a number, for practical purposes it is not. Rather we should work it as a categorical variable. So we modify the data type to object.

In [24]:
df_operations = df_operations.astype({'Customer': 'object'})

In [25]:
df_operations.dtypes

Customer         object
Customer Type    object
Payment Type     object
Purchases         int64
Sales             int64
Refunds           int64
Country          object
Continent        object
dtype: object

Adding new variables to the dataframe.

In [26]:
df_operations['Profits'] = df_operations['Sales'] - df_operations['Purchases']
df_operations.head()

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent,Profits
0,10000,Person,Cash,120000,150000,240,Canada,America,30000
1,10001,Company,Cash,521400,651750,1043,Japan,Asia,130350
2,10002,Company,Credit Card,451000,563750,902,Mexico,America,112750
3,10003,Company,Transfer,565000,706250,1130,Spain,Europe,141250
4,10004,Person,Transfer,512300,640375,1024,Argentina,America,128075

### Practice One: Get a list of all operations on Europe with transfer payment type.

In [27]:
# Type your code here
df_operations[(df_operations["Continent"] == "Europe") & (df_operations["Payment Type"] == "Transfer")]

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent,Profits
3,10003,Company,Transfer,565000,706250,1130,Spain,Europe,141250
13,10013,Person,Transfer,352000,440000,704,Germany,Europe,88000

### Practice Two: Get the columns Customer, Country and Continent of operations dataframe. But only the rows five, six and seven.

In [28]:
# Type your code here
df_operations.loc[5:7,["Customer","Country","Continent"]]

  Customer Country Continent
5    10005  Canada   America
6    10006    EEUU   America
7    10007   Chile   America

### Practice Three: In operations dataframe, add a new column named deduction and assign to it fifteen percent from each row of the column Sales.

In [29]:
# Type your code here
df_operations["Deduction"] = df_operations["Sales"] * 0.15
df_operations.head()

,Customer,Customer Type,Payment Type,Purchases,Sales,Refunds,Country,Continent,Profits,Deduction
0,10000,Person,Cash,120000,150000,240,Canada,America,30000,22500.00
1,10001,Company,Cash,521400,651750,1043,Japan,Asia,130350,97762.50
2,10002,Company,Credit Card,451000,563750,902,Mexico,America,112750,84562.50
3,10003,Company,Transfer,565000,706250,1130,Spain,Europe,141250,105937.50
4,10004,Person,Transfer,512300,640375,1024,Argentina,America,128075,96056.25